Repository: SwampRabbit/snippetpixie
Catalog: po/*.po
Languages: fr

source: Save your often used snippets and then expand them whenever you type their abbreviation.
fr: Sauvegardez vos raccourcis souvent utilisés et développez-les à chaque fois que vous tapez leur abréviation.

source: For example:- "spr`" expands to "Snippet Pixie rules!"
fr: Par exemple : - « rsp` » s'étendra en « Règles de Snippet Pixie ! »

source: Added ability to export snippets to a JSON file via `--export` or `-e` CLI options.
fr: Ajout de la possibilité d'exporter des extraits vers un fichier JSON via les options en ligne de commande `--export` ou `-e`.

source: Added ability to import snippets from an exported JSON file via `--import` or `-i` CLI options. Bet you didn't see that coming! 😉
fr: Possibilité d'importer des extraits d'un fichier JSON exporté via les options en ligne de commande `--import` ou `-i`. Je parie que vous ne l'aviez pas vu venir ! 😉

source: 1.0 Release!
fr: Version 1.0 !

source: Added Snippet Pixie to login startup items by default.
fr: Ajout de Snippet Pixie aux éléments de démarrage par défaut à la connexion.

source: Added --autostart={on|off|status} option to CLI for turning autostart on, off, or getting settings status.
fr: Ajout de l'option --autostart={on|off|status} aux lignes de commande pour activer, désactiver ou obtenir le statut des paramètres.

source: Changed body field to select all text when tabbed into.
fr: Changement du champ de texte pour sélectionner tout le texte lorsqu'il est affiché sous forme d'onglets.

source: Fixed crash when an application with a large number of controls was activated.
fr: Correction d'un plantage lorsqu'une application avec un grand nombre de contrôles était activée.

source: Fixed problem with snippets sometimes not expanding when returning to an application.
fr: Correction d'un problème avec les raccourcis qui ne se développaient pas toujours lors du retour à une application.

source: Added a splash of colour to the window header.
fr: Ajout d'une touche de couleur à l'en-tête de la fenêtre.

source: Added a new application icon.
fr: Ajout d'une nouvelle icône d'application.

source: Initial pre-release.
fr: Pré-version initiale.

source: expand;text;snippet;
fr: étendre;texte;raccourci;

source: Show Snippet Pixie's window (default action)
fr: Afficher la fenêtre de Snippet Pixie (action par défaut)

source: Start with no window
fr: Lancer sans fenêtre

source: Fully quit the application, including the background process
fr: Quitter complétement l'application, ainsi que le processus en arrière-plan

source: Turn auto start of Snippet Pixie on login, on, off, or show status of setting
fr: Activer le démarrage automatique de Snippet Pixie lors de la connexion, activer, désactiver ou afficher l'état des paramètres

source: Shows status of the application, exits with status 0 if running, 1 if not
fr: Affiche l'état de l'application, quitte avec le statut 0 si en cours d'exécution, 1 sinon

source: Import snippets from file, skips snippets where abbreviation already exists
fr: Importer des raccourcis à partir d'un fichier, ignore les raccourcis où l'abréviation existe déjà

source: filename
fr: Nom du fichier

source: If used in conjunction with import, existing snippets with same abbreviation are updated
fr: S'ils sont utilisés conjointement avec l'importation, les raccourcis existants avec la même abréviation sont mis à jour

source: Display version number
fr: Afficher le numéro de version

source: Display this help
fr: Afficher cette aide

source: error: %s
fr: Erreur : %s

source: Run '%s --help' to see a full list of available command line options.
fr: Exécutez « %s --help » pour visualiser la liste complète des options disponibles en ligne de commande.

source: Quitting...
fr: Fermeture…

source: Running.
fr: En cours d'exécution.

source: Not Running.
fr: Pas en cours d'exécution.

source: Invalid autostart value "%s".
fr: Valeur de démarrage automatique invalide « %s ».

source: Import Snippets
fr: Importer des raccourcis

source: Import
fr: Importer

source: Overwrite Duplicate Snippets?
fr: Écraser les raccourcis en double ?

source: If any of the snippet abbreviations about to be imported already exist, do you want to skip importing them or update the existing snippet?
fr: Si l'un des raccourcis d'abréviation sur le point d'être importé existe déjà, voulez-vous sauter l'importation ou mettre à jour le raccourci existant ?

source: Update Existing
fr: Mettre à jour l'existant

source: Cancel
fr: Annuler

source: Skip Duplicates
fr: Ignorer les doublons

source: Imported Snippets
fr: Raccourcis importés

source: Your snippets were successfully imported.
fr: Vos raccourcis ont été importés avec succès.

source: Failed to import selected file
fr: Échec de l'importation du fichier sélectionné

source: Snippet Pixie can currently only import the JSON format files that it also exports.
fr: Snippet Pixie ne peut actuellement importer que les fichiers au format JSON qu'il exporte également.

source: Export Snippets
fr: Exporter les raccourcis

source: Exported Snippets
fr: Raccourcis exportés

source: Your snippets were successfully exported.
fr: Vos raccourcis ont été exportés avec succès.

source: Failed to export to file
fr: Échec de l'exportation du fichier

source: Something went wrong, sorry.
fr: Une erreur s'est produite, désolé.

source: Add snippet
fr: Ajouter un raccourci

source: Import snippets…
fr: Importer des raccourcis…

source: Export snippets…
fr: Exporter des raccourcis…

source: About…
fr: À propos…

source: new
fr: Nouveau

source: Something to be replaced
fr: Quelque chose à remplacer

source: Abbreviation
fr: Abbréviation

source: Body
fr: Corps

source: No snippets found.
fr: Aucun raccourci trouvé.

source: Add Snippet
fr: Ajouter un raccourci

source: Create your first snippet.
fr: Créez votre premier raccourci.

source: Import previously exported snippets.
fr: Importez vos raccourcis précédemment exportés.

source: Quick Start Guide
fr: Guide de démarrage rapide

source: Learn the basics of how to use Snippet Pixie.
fr: Apprenez les bases de l'utilisation de Snippet Pixie.
